# Introdunction to Supervised Machine Learning
Supervised learning algorithms are a category of machine learning models that rely on labeled data for training. In supervised learning, the algorithm learns to map inputs to outputs by analyzing a dataset that includes both the input features and the correct corresponding labels (the output). After the model is trained, it can be used to predict the label for new, unseen data.

In Supervised Machine Learning:
- Machines are trained with labelled data as input.
- The Machine learning model identify:
    - Patterns and methods
    - Learn from them
    - Predicts output
    
- Supervised Machine learning algorithms includes:
    - Linear and Logistic regression
    - Multi-class classification
    - Decision trees
    - Support vector machines
    
- Supervised machine learning  is used to detect:
    - Forest fires
    - Oil & gas tragedies
    - Shipping fires
    - Building fires
    
If we use the Supervised machine learning model to detection of fire incident in that case we have to include some parameters like:
- Area spread of fire
- smoke levels
- Temperature
- Rate of increase of spread
- Outcome labelled as fire incident or not

## Algorithms of Supervised Machine learning

Supervised machine have a two types of algorithms:
- Classification
- Regression


### Classification
Classification algorithm segregates data into two or more categories with one or more inputs, a classification model predicts the value of one or more outcomes.

we are use the classification model to segregate the emails into Spam or Ham, so first model examines the data to find patterns and methods to determine whether email is a Ham or a Spam

### Regression
Regression algorithms establishes the relationship between input and output variables which is suitable for situations where the output variable is a real or continuous value.

A regression algorithm is used to forecast or predict the value of the stock market.

# Application of Supervised Machine Learning
- Quality inspection in manufacturing: Inspects quality and classify manufactured products in the good condition or damaged condition.
- Forecasting for the maritme industry
- Fraud protection measurs
- Waste management Systems
- Healthcare
- Marketing and Sales
- Retail and E-Commerce
- Product Recommendation
- Price Optimization

# Preparing and Shaping Data

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [5]:
df = sns.load_dataset('titanic') # load the titanic data set

In [7]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [10]:
df['Travelalone'] = np.where((df['sibsp'] + df['parch'])> 0, 0, 1).astype('uint8')

In [ ]:
df = df.drop(['P'])